Revit 2027 API
ProgressStage Enumeration
 The associated action of a ProgressChanged event
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ProgressStage
Public Enumeration ProgressStage
public enum class ProgressStage
type ProgressStage
Members
Member name | Value | Description
CaptionChanged | 3 |  Progress bar has set new Text
Finished | 5 |  Progress bar is finished
PositionChanged | 2 |  Progress bar has set new position
RangeChanged | 1 |  Progress bar has set new range
Started | 0 |  Progress bar has started
Unchanged | 4 |  Progress bar has not changed position
See Also
Reference
Autodesk.Revit.DB.Events Namespace